# Aggregation and Grouping

In [3]:
import numpy as np 
import pandas as pd

In [4]:
class display(object):
    """Display HTML representation of multiple objects"""
    
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}{1} """
    
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_()) for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a)) for a in self.args)

## Planets Data

In [5]:
import seaborn as sns

In [6]:
planets = sns.load_dataset('planets') 
planets.shape

(1035, 6)

In [7]:
type(planets)

pandas.core.frame.DataFrame

In [8]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

## Simple Aggregation in Pandas

In [9]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [10]:
ser.sum()

2.811925491708157

In [11]:
ser.mean()

0.5623850983416314

In [12]:
ser.var()

0.09532548164256274

In [13]:
type(rng.rand(8))

numpy.ndarray

In [14]:
df = pd.DataFrame({'A' : rng.rand(5), 'B' : rng.rand(5)})
df

          A         B
0  0.212339  0.431945
1  0.181825  0.291229
2  0.183405  0.611853
3  0.304242  0.139494
4  0.524756  0.292145

In [15]:
df.sum()

A    1.406567
B    1.766666
dtype: float64

In [16]:
df.mean()

A    0.281313
B    0.353333
dtype: float64

In [17]:
df.mean(axis = 'columns')

0    0.322142
1    0.236527
2    0.397629
3    0.221868
4    0.408451
dtype: float64

In [18]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [19]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

### Table: Listing of Pandas aggregation methods

| Aggregation |             Returns               |
|-------------|-----------------------------------|
| count       | Total number of items             |
| first, last | First and last item               |
| mean, median| Mean and median                   |
| min, max    | Minimum and maximum               |
| std, var    | Standard deviation and variance   |
| mad         | Mean absolute deviation           |
| prod        | Product of all items              |
| sum         | Sum of all items                  |

## groupby: Split, Apply, Combine

### Split, Apply, Combine

In [20]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [21]:
df.groupby('key')

In [22]:
df.groupby('key').mad()

     data
key
A     1.5
B     1.5
C     1.5

In [23]:
df.groupby('key').prod()

     data
key
A       0
B       4
C      10

In [24]:
df.groupby('key').first()

     data
key
A       0
B       1
C       2

### The GroupBy Object

#### Column indexing

In [25]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [26]:
planets['method'].unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [27]:
planets.groupby('method')

In [28]:
planets.groupby('method')['orbital_period']

In [29]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

#### Iteration over groups

In [30]:
for (method, group) in planets.groupby('method'): 
    print("{0:29s} count = {1}".format(method, group.shape[0]))

Astrometry                    count = 2
Eclipse Timing Variations     count = 9
Imaging                       count = 38
Microlensing                  count = 23
Orbital Brightness Modulation count = 3
Pulsar Timing                 count = 5
Pulsation Timing Variations   count = 1
Radial Velocity               count = 553
Transit                       count = 397
Transit Timing Variations     count = 4

#### Dispatch methods

In [31]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

### Aggregate, Filter, Transform, Apply

In [32]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                'data1': range(6),
                'data2': rng.randint(0, 10, 6)},
                columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

#### Aggregation

In [33]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [34]:
df.groupby('key').aggregate(['min', np.median, max, np.sum, np.std, np.prod, 'var', 'mad'])

    data1                                        data2                 \
      min median max sum      std prod  var  mad   min median max sum
key
A       0    1.5   3   3  2.12132    0  4.5  1.5     3    4.0   5   8
B       1    2.5   4   5  2.12132    4  4.5  1.5     0    3.5   7   7
C       2    3.5   5   7  2.12132   10  4.5  1.5     3    6.0   9  12


          std prod   var  mad
key
A    1.414214   15   2.0  1.0
B    4.949747    0  24.5  3.5
C    4.242641   27  18.0  3.0

In [35]:
df.groupby('key').aggregate({'data1': 'min',
                             'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [36]:
df.groupby('key').aggregate({'data1': ['min', np.median, max, np.sum],
                             'data2': 'max'})

    data1                data2
      min median max sum   max
key
A       0    1.5   3   3     5
B       1    2.5   4   5     7
C       2    3.5   5   7     9

#### Filtering

In [37]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [38]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [39]:
df.dropna().std(numeric_only=True)

data1    1.870829
data2    3.209361
dtype: float64

In [40]:
def filter_func(x):
    return x['data2'].std() > 4

In [41]:
filter_func(df)

False

In [42]:
filter_func(df.groupby('key'))

key
A    False
B     True
C     True
Name: data2, dtype: bool

In [43]:
df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

#### Transformation

In [44]:
def center(x):
    return x - x.mean()

In [45]:
df.mean(numeric_only=True)

data1    2.5
data2    4.5
dtype: float64

In [46]:
df.groupby('key').mean()

     data1  data2
key
A      1.5    4.0
B      2.5    3.5
C      3.5    6.0

In [47]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [48]:
df.groupby('key').transform(center)

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

#### The apply method

In [87]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum() 
    return x

In [51]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [50]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

### Specifying the Split Key

#### A list, array, series, or index providing the grouping keys

In [56]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [57]:
L=[0,0,0,1,2,0] 
df.groupby(L).sum()

   data1  data2
0      8     17
1      3      3
2      4      7

In [64]:
df.groupby('key').sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [112]:
df['key']

0    A
1    B
2    C
3    A
4    B
5    C
Name: key, dtype: object

In [62]:
df.groupby(df['key']).sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

#### A dictionary or series mapping index to group

In [65]:
df2 = df.set_index('key')
df2

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

In [73]:
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
df2.groupby(mapping).sum()

           data1  data2
key
consonant     12     19
vowel          3      8

In [68]:
ser = pd.Series({'A': 'vowel', 'B': 'consonant', 'C': 'consonant'})
ser

A        vowel
B    consonant
C    consonant
dtype: object

In [69]:
type(ser)

pandas.core.series.Series

In [74]:
df2.groupby(ser).sum()

           data1  data2
consonant     12     19
vowel          3      8

#### Any Python function

In [75]:
df2.groupby(str.lower).mean()

     data1  data2
key
a      1.5    4.0
b      2.5    3.5
c      3.5    6.0

In [76]:
def grouping_func(index):
    if (index == 'A') | (index == 'C'):
        return 'ac'
    else:
        return 'b'

In [78]:
df2

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

In [77]:
df2.groupby(grouping_func).sum()

     data1  data2
key
ac      10     20
b        5      7

#### A list of valid keys

In [82]:
df2.groupby([str.lower, mapping]).sum()

               data1  data2
key key
a   vowel          3      8
b   consonant      5      7
c   consonant      7     12

In [83]:
df2.groupby([grouping_func, str.lower, mapping]).sum()

                   data1  data2
key key key
ac  a   vowel          3      8
    c   consonant      7     12
b   b   consonant      5      7

### Grouping Example

In [ ]:
decade = 10 * (planets['year'] // 10)
decade

0       2000
1       2000
2       2010
3       2000
4       2000
        ...
1030    2000
1031    2000
1032    2000
1033    2000
1034    2000
Name: year, Length: 1035, dtype: int64

In [96]:
decade = decade.astype(str) + 's'
decade

0       2000s
1       2000s
2       2010s
3       2000s
4       2000s
        ...
1030    2000s
1031    2000s
1032    2000s
1033    2000s
1034    2000s
Name: year, Length: 1035, dtype: object

In [118]:
decade.values

array(['2000s', '2000s', '2010s', ..., '2000s', '2000s', '2000s'],
      dtype=object)

In [98]:
decade.name = 'decade'
decade

0       2000s
1       2000s
2       2010s
3       2000s
4       2000s
        ...
1030    2000s
1031    2000s
1032    2000s
1033    2000s
1034    2000s
Name: decade, Length: 1035, dtype: object

In [100]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [117]:
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [119]:
planets.groupby(['method', decade.values])['number'].sum().unstack().fillna(0)

                               1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [123]:
planets.groupby(['method', decade.values])['number'].sum()

method
Astrometry                     2010s      2
Eclipse Timing Variations      2000s      5
                               2010s     10
Imaging                        2000s     29
                               2010s     21
Microlensing                   2000s     12
                               2010s     15
Orbital Brightness Modulation  2010s      5
Pulsar Timing                  1990s      9
                               2000s      1
                               2010s      1
Pulsation Timing Variations    2000s      1
Radial Velocity                1980s      1
                               1990s     52
                               2000s    475
                               2010s    424
Transit                        2000s     64
                               2010s    712
Transit Timing Variations      2010s      9
Name: number, dtype: int64

In [120]:
planets.groupby(decade.values)['number'].sum()

1980s       1
1990s      61
2000s     587
2010s    1199
Name: number, dtype: int64